// List r101 = [
//   "نظم سياسية و دستوري",
//   "شريعة اسلامية",
//   "اجرام و عقاب",
//   "لغة أجنبية أولي",
//   "لغة أجنبية تانية"
// ];
// List r101val = [
//   "101nozm",
//   "101sh",
//   "101crime",
//   "101lang1",
//   "101lang2",
// ];

List r101 = [
  "مدخل قانون (نظرية حق)",
  "مدخل قانون (نظرية قانون)",
  "دولي",
  "لغة انجليزية",
  "تاريخ الدكتور معتز",
  "تاريخ الدكتور رفعت",
  "اقتصاد كلي",
  "اقتصاد جزئي",
  'انجلو',
  'ايكونومكس',
  'دولي انجليزي',
  'محاسبة'
];

List r101val = [
  "101md5lhaq",
  "101md5lqanon",
  "101int",
  "101lang",
  "101historyMoataz",
  "101historyrefat",
  "101economicf",
  "101economyhalf",
  "101Anglo",
  "101Economics",
  "101internatioEng",
  "101mohasba",
];
////////////////////////////////////////////////
// List r103 = [
//   "قانون جنائي",
//   "مالية عامة و تشرييع ضريبي",
//   "مواريث ووصايا",
//   "قانون العمل و التأمينات اجتماعية"
// ];
// List r103val = ["103crime", "103fin", "103mawareth", "103workninsurance"];

List r103 = [
  "تحكيم",
  "مدني عربي حقوق انجليزي",
  "تجاري عربي لحقوق انجليزي",
  "مرافعات",
  "مواريث",
  "قانون تجاري (شركات)",
  "قانون تجاري (اعمال تجاريه)",
  "قانون مدني (بيع)",
  "قانون مدني (ايجار)",
  "قانون مدني (تأمين)",
  'محاسبة'
];
List r103val = ["103thkem",
  "103mdanyEn",
  "103commercailEn",
  "103moraf3at",
  "103mowareth", "103sharkat", "103a3mal","103madbe4","103madrent","103madbuy",
  "103mohasba",];

///////////////////////////////////////////////
List r102 = [
  " قانون جنائي لحقوق عربي",
  " قانون جنائي لحقوق انجليزي",
  "مدني حقوق عربي",
  "مدني حقوق انجليزي",
  "مدني عربي لحقوق انجليزي",
  "احوال",
  " شريعه عربي",
  " شريعه انجليزي",
  "اقتصاد",
      "ايكونومكس",
  'محاسبة'
];
List r102val = [
  "102cremar",
  "102cremen",
  "102sociar",
  "102socien",
  "102sociarForEn",
  "102ahwal",
  "102sharar",
  "102sharEn",
  "102economyar",
  "102economyen",
"102mohasba",
];

// List r102 = [
//   "قانون دولي",
//   "قانون اداري",
//   "قانون مدني",
//   "تاريخ القانون",
//   "لغة أجنبية"
// ];
// List r102val = [
//   "102َqi",
//   "102qad",
//   "102qm",
//   "102qh",
//   "102lang",
// ];
///////////////////////////////////////////////
// List r104 = ["تنفيذ جبري", "دولي خاص", "قانون تجاري", "قانون زراعي"];
// List r104val = ["104tnfez", "104privite", "104commerce", "104farm"];
List r104 = ["اجراءات جنائية", "اصول فقه", "اداره عامة", "مدني (ملكية)","مدني(تأمينات عينية)","بحري و جوي",
  'محاسبة','تكاليف'];
List r104val = ["104egrat", "104feqh", "104edara", "104mad","104ensuran","104airsee",
"104mohasba",'104taklef'];
