List r101 = [
  "نظم سياسية و دستوري",
  "شريعة اسلامية",
  "اجرام و عقاب",
  "لغة أجنبية أولي",
  "لغة أجنبية تانية"
];
List r101val = [
  "101nozm",
  "101sh",
  "101crime",
  "101lang1",
  "101lang2",
];
////////////////////////////////////////////////
List r103 = [
  "قانون جنائي",
  "مالية عامة و تشرييع ضريبي",
  "مواريث ووصايا",
  "قانون العمل و التأمينات اجتماعية"
];
List r103val = ["103crime", "103fin", "103mawareth", "103workninsurance"];
///////////////////////////////////////////////
List r102 = [
  "قانون دولي",
  "قانون اداري",
  "قانون مدني",
  "تاريخ القانون",
  "لغة أجنبية"
];
List r102val = [
  "102َqi",
  "102qad",
  "102qm",
  "102qh",
  "102lang",
];
///////////////////////////////////////////////
List r104 = ["تنفيذ جبري", "دولي خاص", "قانون تجاري", "قانون زراعي"];
List r104val = ["104tnfez", "104privite", "104commerce", "104farm"];
