// List r101 = [
//   "نظم سياسية و دستوري",
//   "شريعة اسلامية",
//   "اجرام و عقاب",
//   "لغة أجنبية أولي",
//   "لغة أجنبية تانية"
// ];
// List r101val = [
//   "101nozm",
//   "101sh",
//   "101crime",
//   "101lang1",
//   "101lang2",
// ];

List r101 = [
  "مدخل قانون (نظرية حق)",
  "مدخل قانون (نظرية قانون)",
  "دولي",
  "لغة",
  "تاريخ",
  "اقتصاد كلي",
  "اقتصاد جزئي"
];

List r101val = [
  "101md5lhaq",
  "101md5lqanon",
  "101int",
  "101lang",
  "101history",
  "101economicf",
  "101economyhalf"
];
////////////////////////////////////////////////
// List r103 = [
//   "قانون جنائي",
//   "مالية عامة و تشرييع ضريبي",
//   "مواريث ووصايا",
//   "قانون العمل و التأمينات اجتماعية"
// ];
// List r103val = ["103crime", "103fin", "103mawareth", "103workninsurance"];

List r103 = [
  "مرافعات",
  "مواريث",
  "قانون تجاري (شركات)",
  "قانون تجاري (اعمال تجاريه)",

  "قانون مدني (بيع)",
  "قانون مدني (ايجار)",

  "قانون مدني (تأمين)"
];
List r103val = ["103moraf3at", "103mowareth", "103sharkat", "103a3mal","103madbe4","103madrent","103madbuy"];

///////////////////////////////////////////////
List r102 = [
  "قانون جنائي",
  "قانون مدني",
  "احوال",
  "شريعه",
  "اقتصاد"
];
List r102val = [
  "102crem",
  "102social",
  "102ahwal",
  "102shar",
  "102economy",
];

// List r102 = [
//   "قانون دولي",
//   "قانون اداري",
//   "قانون مدني",
//   "تاريخ القانون",
//   "لغة أجنبية"
// ];
// List r102val = [
//   "102َqi",
//   "102qad",
//   "102qm",
//   "102qh",
//   "102lang",
// ];
///////////////////////////////////////////////
// List r104 = ["تنفيذ جبري", "دولي خاص", "قانون تجاري", "قانون زراعي"];
// List r104val = ["104tnfez", "104privite", "104commerce", "104farm"];
List r104 = ["اجراءات جنائية", "اصول فقه", "اداره عامة", "مدني (ملكية)","مدني(تأمينات عينية)","بحري و جوي"];
List r104val = ["104egrat", "104feqh", "104edara", "104mad","104ensuran","104airsee",];
